
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-rota-dtu-connection-string&#34;]
* Update
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-rota-dtu-instrumentation-key&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-rota-dtu-connection-string"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "app-insights-rota-dtu-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "App Insights"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-insights-rota-dtu-instrumentation-key"] will be destroyed
  # (because key ["app-insights-rota-dtu-instrumentation-key"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "secret" {
      - content_type            = "" -> null
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
      - id                      = "https://hmi-kv-stg.vault.azure.net/secrets/app-insights-rota-dtu-instrumentation-key/3e98c0b29c4f4186b12f0938af73f44d" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> null
      - name                    = "app-insights-rota-dtu-instrumentation-key" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/app-insights-rota-dtu-instrumentation-key/versions/3e98c0b29c4f4186b12f0938af73f44d" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/app-insights-rota-dtu-instrumentation-key" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "application"         = "hearings-management-interface"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
          - "source"              = "App Insights"
        } -> null
      - value                   = (sensitive value)
      - version                 = "3e98c0b29c4f4186b12f0938af73f44d" -> null
      - versionless_id          = "https://hmi-kv-stg.vault.azure.net/secrets/app-insights-rota-dtu-instrumentation-key" -> null
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg"
        name                       = "hmi-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"","Vars":{}} -->